f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오
- 결측치는 'f1' 데이터에서 큰 값 순으로 정렬했을 때 10번째에 위치한 값으로 채운다.
- 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함
- 최종 결과값은 절대값으로 출력
(중복 제거 기준: 제공된 데이터 순서대로 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함)

In [132]:
import pandas as pd
import numpy as np
df = pd.read_csv('/Users/jochaeyeon/Downloads/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [133]:
top10 = df["f1"].sort_values(ascending=False).iloc[9]
top10

88.0

In [134]:
df["f1"] = df["f1"].fillna(top10)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울  88.0   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울  88.0   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [135]:
result1 = df["f1"].median()
result1

77.5

In [136]:
df.shape

(100, 8)

In [137]:
df = df.drop_duplicates(subset=["age"])
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울  88.0   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울  88.0   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [138]:
df.shape

(71, 8)

In [139]:
result2 = df["f1"].median()
result2

77.0

In [140]:
print(result1-result2)

0.5